<a href="https://colab.research.google.com/github/anubhavanand3116/MachineLearning/blob/main/1_pandas_intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
url= 'https://raw.githubusercontent.com/codebasics/py/master/pandas/1_intro/nyc_weather.csv'
df=pd.read_csv(url)

In [ ]:
df.head(5)

        EST  Temperature  DewPoint  ...  CloudCover  Events  WindDirDegrees
0  1/1/2016           38        23  ...           5     NaN             281
1  1/2/2016           36        18  ...           3     NaN             275
2  1/3/2016           40        21  ...           1     NaN             277
3  1/4/2016           25         9  ...           3     NaN             345
4  1/5/2016           20        -3  ...           0     NaN             333

[5 rows x 11 columns]

In [ ]:
df['Temperature'].max()

50

In [ ]:
df['EST'][df['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [ ]:
df1 = pd.DataFrame([[np.nan, 2, np.nan, 0],
...                    [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, 5],
...                    [np.nan, 3, np.nan, 4]],
...                   columns=list('ABCD'))

In [ ]:
df1.head()

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [ ]:
values= {'A':0,'B':1,'C':2,'D':3}
df1.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [ ]:
df.fillna(0,inplace=True)

In [ ]:
df.head(5)

        EST  Temperature  DewPoint  ...  CloudCover  Events  WindDirDegrees
0  1/1/2016           38        23  ...           5       0             281
1  1/2/2016           36        18  ...           3       0             275
2  1/3/2016           40        21  ...           1       0             277
3  1/4/2016           25         9  ...           3       0             345
4  1/5/2016           20        -3  ...           0       0             333

[5 rows x 11 columns]

In [ ]:
df['WindDirDegrees'].mean()

247.1290322580645

In [ ]:
df['WindSpeedMPH'].mean()

6.225806451612903